In [14]:
import pandas as pd
import numpy as np
data3 = pd.read_csv("..//raw//ex_rate_usd_rup.csv",header=None) #relative path represented as ..
data3.columns=['Date3','exchange']
print(data3.columns)

Index(['Date3', 'exchange'], dtype='object')

In [15]:
data3=data3.drop(index=[0])
data3

          Date3   exchange
1    1967-01-01    137.000
2    1967-02-01    137.000
3    1967-03-01    137.000
4    1967-04-01    137.000
5    1967-05-01    137.000
..          ...        ...
680  2023-08-01  15239.000
681  2023-09-01  15526.000
682  2023-10-01  15916.000
683  2023-11-01  15384.000
684  2023-12-01  15416.000

[684 rows x 2 columns]

In [16]:
data3['Date3'] = pd.to_datetime(data3['Date3'], format='%Y-%m-%d',errors='coerce')
data3['exchange']=pd.to_numeric(data3['exchange'],errors='coerce') 
data3=data3.dropna(subset=['Date3'])  #drop rows with invalid data
data3

         Date3  exchange
1   1967-01-01     137.0
2   1967-02-01     137.0
3   1967-03-01     137.0
4   1967-04-01     137.0
5   1967-05-01     137.0
..         ...       ...
680 2023-08-01   15239.0
681 2023-09-01   15526.0
682 2023-10-01   15916.0
683 2023-11-01   15384.0
684 2023-12-01   15416.0

[684 rows x 2 columns]

In [17]:
data3.set_index('Date3',inplace=True) 
quarterly3=data3.resample('ME').mean() 
quarterly3.reset_index(inplace=True)  
print(quarterly3)

         Date3  exchange
0   1967-01-31     137.0
1   1967-02-28     137.0
2   1967-03-31     137.0
3   1967-04-30     137.0
4   1967-05-31     137.0
..         ...       ...
679 2023-08-31   15239.0
680 2023-09-30   15526.0
681 2023-10-31   15916.0
682 2023-11-30   15384.0
683 2023-12-31   15416.0

[684 rows x 2 columns]

In [18]:
quarterly3.to_csv("ex_rate_rup.csv", index=False)

In [19]:
quarterly3

         Date3  exchange
0   1967-01-31     137.0
1   1967-02-28     137.0
2   1967-03-31     137.0
3   1967-04-30     137.0
4   1967-05-31     137.0
..         ...       ...
679 2023-08-31   15239.0
680 2023-09-30   15526.0
681 2023-10-31   15916.0
682 2023-11-30   15384.0
683 2023-12-31   15416.0

[684 rows x 2 columns]